=dovelet 	 짝 홀수성/even_odd
프로그램 명: even_odd(open)
제한시간: 1 초
짝,홀수성을 공부 중인 주희는

덧셈에서는 짝수(even)끼리 , 홀수(odd)끼리의 합은 짝수이고 , 짝/홀수가 섞여 있는 경우 홀수가 된다는 것을 ,


곱셈에서는 곱하는 두 수 중 짝수가 하나라도 있는 경우에는 짝수가 된다는 것을 알았다.
이를 컴퓨터로 확인 해 보기로 했다.

입력

1000 이하의 두 자연수가 입력으로 주어진다.
출력

공백없이 출력 예의 형식으로 출력한다.
입출력 예

입력

5 8

출력

odd+even=odd
odd*even=even

입력

8 5

출력

even+odd=odd
even*odd=even

입력

5 3

출력

odd+odd=even
odd*odd=odd
[질/답] [제출 현황] [푼 후(15)]
[ 채 점 ] [홈으로]  [뒤 로]
=cut

# sub k{return$_[0]%2?"odd":"even"}<>=~/(.+) (.+)/;print(k($1),"+",k($2),"=",k($1+$2),"\n",k($1),"*",k($2),"=",k($1*$2))
# sub k{return$_[0]%2?"odd":"even"}<>=~/(.+) (.+)/;printf"%s+%s=%s\n%s*%s=%s",k($1),k($2),k($1+$2),k($1),k($2),k($1*$2)
# sub k{return$_[0]%2?"odd":"even"}<>=~/(.+) (.+)/;print(k($1),"+",k($2),"=",k($1+$2),$',k($1),"*",k($2),"=",k($1*$2))
# sub k{$_[0]%2?"odd":"even"}<>=~/(.+) (.+)/;print(k($1),"+",k($2),"=",k($1+$2),$',k($1),"*",k($2),"=",k($1*$2))

# <>=~/(.+) (.+)/;@n=("even","odd");printf"%s+%s=%s\n%s*%s=%s",@n[$1&1],@n[$2&1],@n[$1+$2&1],@n[$1&1],@n[$2&1],@n[$1*$2&1]
# <>=~/(.+) (.+)/;@n=("even","odd");$a=@n[$1&1];$b=@n[$2&1];printf"%s+%s=%s\n%s*%s=%s",$a,$b,@n[$1+$2&1],$a,$b,@n[$1*$2&1]

sub k{$_[0]%2?"odd":"even"}
<DATA>=~/(.+) (.+)/;
print(k($1),"+",k($2),"=",k($1+$2),$',k($1),"*",k($2),"=",k($1*$2));

#@n=("even","odd");
#$a=@n[$1&1];
#$b=@n[$2&1];
#printf"%s+%s=%s\n%s*%s=%s",$a,$b,@n[$1+$2&1],$a,$b,@n[$1*$2&1];


__DATA__
60 51

